InformationRegisters/ТоварыНаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНаККМ</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварыНаККМ/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "Перед записью"
//
// Параметры
//  Отказ     - <Булево>
//            - Признак отказа от записи набора регистра сведений. Если в теле
//              процедуры-обработчика установить данному параметру значение
//              Истина, запись выполнена не будет. Значение по умолчанию: Ложь
//
//  Замещение - <Булево>
//            - Режим записи набора. Истина - запись осуществляется с заменой
//              существующих в базе данных записей набора. Ложь - запись
//              осуществляется с "дописыванием" текущего набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)

	Описание        = "";

	Если Не ОбменДанными.Загрузка Тогда
		Врем   = "";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|    ВЫБОР
		|        КОГДА РегТовары.Код = &Код ТОГДА
		|            ""Товары с таким значением кода для данной кассы уже существуют:""
		|        ИНАЧЕ
		|            ""Товары с таким набором данных для данной кассы уже существуют:""
		|    КОНЕЦ                                               КАК ТекстОшибки,
		|    ПРЕДСТАВЛЕНИЕ(&КассаККМ)                            КАК КассаККМ,
		|    ПРЕДСТАВЛЕНИЕ(РегТовары.Код)                        КАК Код,
		|    ПРЕДСТАВЛЕНИЕ(РегТовары.Номенклатура)               КАК Номенклатура,
		|    ПРЕДСТАВЛЕНИЕ(РегТовары.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|    ПРЕДСТАВЛЕНИЕ(РегТовары.СерияНоменклатуры)          КАК СерияНоменклатуры,
		|    ПРЕДСТАВЛЕНИЕ(РегТовары.ЕдиницаИзмерения)           КАК ЕдиницаИзмерения
		|ИЗ
		|    РегистрСведений.ТоварыНаККМ КАК РегТовары
		|ГДЕ
		|    РегТовары.КассаККМ = &КассаККМ
		|    И ((РегТовары.Код = &Код)
		|        ИЛИ
		|        (РегТовары.Номенклатура = &Номенклатура)
		|         И РегТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|         И РегТовары.СерияНоменклатуры = &СерияНоменклатуры
		|         И РегТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения)");

		Для Каждого Врем Из ЭтотОбъект Цикл
			Если Врем.Номенклатура.Набор Тогда
				Описание    = Описание
				              + ?(ПустаяСтрока(Описание),
				                  " - ",
				                  "
				                  | - ")
				              + НСтр("ru='Работа с наборами не поддерживается.';uk='Робота з наборами не підтримується.'");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Врем.ЕдиницаИзмерения) Тогда
				Описание    = Описание
				              + ?(ПустаяСтрока(Описание),
				                  " - ",
				                  "
				                  | - ")
				              + НСтр("ru='Не задана единица измерения.';uk='Не задана одиниця виміру.'");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Врем.КассаККМ) Тогда
				Описание    = Описание
				              + ?(ПустаяСтрока(Описание),
				                  " - ",
				                  "
				                  | - ")
				              + НСтр("ru='Не задано значение КассаККМ.';uk='Не задано значення КассаККМ.'");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Врем.Код) Тогда
				Описание    = Описание
				              + ?(ПустаяСтрока(Описание),
				                  " - ",
				                  "
				                  | - ")
				              + НСтр("ru='Не задан код.';uk='Не заданий код.'");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Врем.Номенклатура) Тогда
				Описание    = Описание
				              + ?(ПустаяСтрока(Описание),
				                  " - ",
				                  "
				                  | - ")
				              + НСтр("ru='Не задана номенклатура.';uk='Не задана номенклатура.'");
			КонецЕсли;
			Запрос.УстановитьПараметр("Код",                        Врем.Код);
			Запрос.УстановитьПараметр("КассаККМ",                   Врем.КассаККМ);
			Запрос.УстановитьПараметр("Номенклатура",               Врем.Номенклатура);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Врем.ХарактеристикаНоменклатуры);
			Запрос.УстановитьПараметр("СерияНоменклатуры",          Врем.СерияНоменклатуры);
			Запрос.УстановитьПараметр("ЕдиницаИзмерения",           Врем.ЕдиницаИзмерения);
			Выборка = Запрос.Выполнить();
			Если Выборка.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			Выборка = Выборка.Выбрать();
			Пока Выборка.Следующий() Цикл
				Ошибка   =                                Выборка.ТекстОшибки                        + Символы.ПС
				           + НСтр("ru='   Касса: ""';uk='   Каса: ""'")             + Выборка.КассаККМ                   + """"  + Символы.ПС
				           + "   Код: """               + Выборка.Код                        + """"  + Символы.ПС
				           + "   Номенклатура: """      + Выборка.Номенклатура               + """"  + Символы.ПС
				           + "   Характеристика: """    + Выборка.ХарактеристикаНоменклатуры + """"  + Символы.ПС
				           + НСтр("ru='   Серия: ""';uk='   Серія: ""'")             + Выборка.СерияНоменклатуры          + """"  + Символы.ПС
				           + НСтр("ru='   Единица измерения: ""';uk='   Одиниця виміру: ""'") + Выборка.ЕдиницаИзмерения           + """"  + Символы.ПС;
				Описание = Описание
				           + ?(ПустаяСтрока(Описание),
				               " - ",
				               "
				               | - ")
				           + Ошибка;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Если Не ПустаяСтрока(Описание) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(Описание, Отказ);
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
